
#Область ОписаниеПеременных

Перем Форма;
Перем ДобавляемыеРеквизиты;
Перем ТекущийЭлемент;
Перем ТекущаяКоманда;
Перем ТекущийПоток;
Перем Элементы;
Перем Команды;
Перем ПутьРеквизита;

// BSLLS:ExportVariables-off
// Структура с перечнем обработок расширения formhelper. Заполняется при нинициализации
Перем Компоненты Экспорт;
// BSLLS:ExportVariables-on

#КонецОбласти

#Область ПрограммныйИнтерфейс

#Область Инициализация

// Инициализирует весь механизм расширения включая работу с динамическими списками и таблицами
//
// Параметры:
//    _Форма - Форма - форма в которую предполагается добавлять новые элементы
//
Процедура Инициализация(_Форма) Экспорт

	Форма = _Форма;
	ДобавляемыеРеквизиты = Новый Массив;
	ТаблицаКоманд();
	ТаблицаЭлементов();
	ПутьРеквизита = "";
	
	ИнициализацияКомпонентов();
	
КонецПроцедуры

// Возвращает форму для которой инициализирован механизм динамического изменения форм
//
// Возвращаемое значение:
//     Форма - 
//
Функция Форма() Экспорт
	Возврат Форма;	
КонецФункции // Форма()

#КонецОбласти

#Область Реквизиты__Р

// Добавляет новый реквизит в массив добавляемых реквизитов
// 
// Параметры:
//    Имя - Строка        - имя реквизита
//    Тип - ОписаниеТипов - тип реквизита
//
// Возвращаемое значение:
//    ОбработкаОбъект.ПостроительФорм - эта обработка для дальнейшего вызова функций в "текучем" стиле
//
Функция ДобавитьРеквизит(Имя, Тип) Экспорт
 
	ПроверитьИмя(Имя, "ДобавитьРеквизит");
	Если Не ТипЗнч(Тип) = Тип("ОписаниеТипов") Тогда
		ВызватьИсключение СтрШаблон("ДобавитьРеквизит %1: тип параметра ""Тип"" должен быть ""ОписаниеТипов""", Имя);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Тип) Тогда
		ВызватьИсключение СтрШаблон("ДобавитьРеквизит %1: параметр ""Тип"" должен быть заполнен", Имя);
	КонецЕсли;

	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Имя, Тип, ПутьРеквизита));	
	
	Возврат ЭтотОбъект;

КонецФункции // ДобавитьРеквизит()

// Выполняет добавление описанных ранее реквизитов на форму
// 
// Возвращаемое значение:
//    ОбработкаОбъект.ПостроительФорм - эта обработка для дальнейшего вызова функций в "текучем" стиле
//
Функция СоздатьРеквизиты() Экспорт

	Если ДобавляемыеРеквизиты.Количество() > 0 Тогда
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);	
	КонецЕсли;
	
	ДобавляемыеРеквизиты = Новый Массив;
	
	Возврат ЭтотОбъект;

КонецФункции // СоздатьРеквизиты()

// Добавляет новый реквизит в массив добавляемых реквизитов с типом "Дата"
// 
// Параметры:
//    Имя       - Строка    - имя реквизита
//    ЧастьДаты - ЧастиДаты - определяет допустимые части даты
//
// Возвращаемое значение:
//    ОбработкаОбъект.ПостроительФорм - эта обработка для дальнейшего вызова функций в "текучем" стиле
//
Функция РеквизитДата(Имя, ЧастьДаты = Неопределено) Экспорт 
	
	ПроверитьИмя(Имя, "РеквизитДата");
	Если Не ТипЗнч(ЧастьДаты) = Тип("Неопределено") И Не ТипЗнч(ЧастьДаты) = Тип("ЧастиДаты") Тогда
		ВызватьИсключение СтрШаблон("РеквизитДата %1: тип параметра ""ЧастьДаты""
			|должен быть ""ЧастиДаты"" или ""Неопределено""", Имя);
	КонецЕсли;

	Если ЧастьДаты = Неопределено Тогда
		ЧастьДаты = ЧастиДаты.ДатаВремя;
	КонецЕсли;
	
	ТипРеквизита = Новый ОписаниеТипов("Дата",,,Новый КвалификаторыДаты(ЧастьДаты));
	
	ДобавитьРеквизит(Имя, ТипРеквизита); 
	
	Возврат ЭтотОбъект;
	
КонецФункции
	
// Добавляет новый реквизит в массив добавляемых реквизитов с типом "Булево"
// 
// Параметры:
//    Имя - Строка - имя реквизита
//
// Возвращаемое значение:
//    ОбработкаОбъект.ПостроительФорм - эта обработка для дальнейшего вызова функций в "текучем" стиле
//
Функция РеквизитБулево(Имя) Экспорт 
	
	ПроверитьИмя(Имя, "РеквизитБулево");

	ТипРеквизита = Новый ОписаниеТипов("Булево");
	
	ДобавитьРеквизит(Имя, ТипРеквизита); 
	
	Возврат ЭтотОбъект;
	
КонецФункции
	
// Добавляет новый реквизит в массив добавляемых реквизитов с типом "Число"
//
// Параметры:
//    Имя      - Строка - имя реквизита
//    Размер   - Число  - общее число разрядов числа
//    Точность - Число  - число разрядов дробной части числа
//
// Возвращаемое значение:
//    ОбработкаОбъект.ПостроительФорм - эта обработка для дальнейшего вызова функций в "текучем" стиле
//
Функция РеквизитЧисло(Имя, Размер = 15, Точность = 2) Экспорт 
	
	ПроверитьИмя(Имя, "РеквизитЧисло");
	Если Не ТипЗнч(Размер) = Тип("Число") Тогда
		ВызватьИсключение СтрШаблон("РеквизитЧисло %1: параметр ""Размер"" должен быть числового типа", Имя);
	КонецЕсли;
	Если Не ТипЗнч(Точность) = Тип("Число") Тогда
		ВызватьИсключение СтрШаблон("РеквизитЧисло %1: параметр ""Точность"" должен быть числового типа", Имя);
	КонецЕсли;
	
	ТипРеквизита = Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(Размер, Точность));
	
	ДобавитьРеквизит(Имя, ТипРеквизита); 
	
	Возврат ЭтотОбъект;
	
КонецФункции
	
// Добавляет новый реквизит в массив добавляемых реквизитов с типом "Строка"
//
// Параметры:
//    Имя   - Строка - имя реквизита
//    Длина - Число  - допустимая длина строки. Если параметр не указан, то строка по длине не ограничивается
//
// Возвращаемое значение:
//    ОбработкаОбъект.ПостроительФорм - эта обработка для дальнейшего вызова функций в "текучем" стиле
//
Функция РеквизитСтрока(Имя, Длина = Неопределено) Экспорт 
	
	ПроверитьИмя(Имя, "РеквизитСтрока");
	Если Не ТипЗнч(Длина) = Тип("Неопределено") И Не ТипЗнч(Длина) = Тип("Число") Тогда
		ВызватьИсключение СтрШаблон("РеквизитСтрока %1: параметр ""Точность""
			|должен быть числового типа или ""Неопределено""", Имя);
	КонецЕсли;

	Если Длина = Неопределено Тогда
		ТипРеквизита = Новый ОписаниеТипов("Строка");
	Иначе
		ТипРеквизита = Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(Длина));
	КонецЕсли;
	
	ДобавитьРеквизит(Имя, ТипРеквизита); 
	
	Возврат ЭтотОбъект;
	
КонецФункции

// Добавляет новый реквизит в массив добавляемых реквизитов с типом "СтандартныйПериод"
//
// Параметры:
//    Имя - Строка - имя реквизита
//
// Возвращаемое значение:
//    ОбработкаОбъект.ПостроительФорм - эта обработка для дальнейшего вызова функций в "текучем" стиле
//
Функция РеквизитСтандартныйПериод(Имя) Экспорт 
	
	ПроверитьИмя(Имя, "РеквизитСтандартныйПериод");

	ТипРеквизита = Новый ОписаниеТипов("СтандартныйПериод");
	
	ДобавитьРеквизит(Имя, ТипРеквизита); 
	
	Возврат ЭтотОбъект;
	
КонецФункции

// Добавляет новый реквизит в массив добавляемых реквизитов с типом "ТаблицаЗначений"
//
// Параметры:
//    Имя - Строка - имя реквизита
//
// Возвращаемое значение:
//    ОбработкаОбъект.ПостроительФорм - эта обработка для дальнейшего вызова функций в "текучем" стиле
//
Функция РеквизитТаблицаЗначений(Имя) Экспорт 
	
	ПроверитьИмя(Имя, "РеквизитТаблицаЗначений");

	ТипРеквизита = Новый ОписаниеТипов("ТаблицаЗначений");
	
	ДобавитьРеквизит(Имя, ТипРеквизита); 
	
	Возврат ЭтотОбъект;
	
КонецФункции

// Добавляет новый реквизит в массив добавляемых реквизитов ссылочного типа
//
// Параметры:
//    Имя       - Строка - имя реквизита
//    ТипСсылки - Строка - описание ссылочного типа данных. Например: "СправочникСсылка.Валюты"
//
// Возвращаемое значение:
//    ОбработкаОбъект.ПостроительФорм - эта обработка для дальнейшего вызова функций в "текучем" стиле
//
Функция РеквизитСсылка(Имя, ТипСсылки) Экспорт 
	
	ПроверитьИмя(Имя, "РеквизитСсылка");
	Если Не ТипЗнч(ТипСсылки) = Тип("Строка") Тогда
		ВызватьИсключение СтрШаблон("РеквизитСсылка %1: параметр ""ТипСсылки"" должен быть строкового типа", Имя);
	КонецЕсли;
	Если ПустаяСтрока(ТипСсылки) Тогда
		ВызватьИсключение СтрШаблон("РеквизитСсылка %1: параметр ""ТипСсылки"" должен быть заполнен", Имя);
	КонецЕсли;
	Если Не ЭтоОбъектСсылочногоТипа(ТипСсылки) Тогда
		ВызватьИсключение СтрШаблон("РеквизитСсылка %1: параметр ""ТипСсылки""
			|должен быть строкой описывающей ссылочный тип данных", Имя);
	КонецЕсли;

	ТипРеквизита = Новый ОписаниеТипов(ТипСсылки);	
	
	ДобавитьРеквизит(Имя, ТипРеквизита); 
	
	Возврат ЭтотОбъект;
	
КонецФункции

// Добавляет новый реквизит в массив добавляемых реквизитов с типом "ДинамическийСписок"
//
// Параметры:
//    Имя - Строка - имя реквизита
//
// Возвращаемое значение:
//    ОбработкаОбъект.ПостроительФорм - эта обработка для дальнейшего вызова функций в "текучем" стиле
//
Функция РеквизитДинамическийСписок(Имя) Экспорт 
	
	ПроверитьИмя(Имя, "РеквизитДинамическийСписок");

	ТипРеквизита = Новый ОписаниеТипов("ДинамическийСписок");
	
	ДобавитьРеквизит(Имя, ТипРеквизита); 
	
	Возврат ЭтотОбъект;
	
КонецФункции

#КонецОбласти

#Область Команды__К

// TODO:
//
// Параметры:
//    Имя   - Строка - 
//    Метод - Строка - 
//
// Возвращаемое значение:
//    ОбработкаОбъект.ПостроительФорм - эта обработка для дальнейшего вызова функций в "текучем" стиле
//
Функция Команда(Имя, Метод) Экспорт
	
	ТекущаяКоманда = ПараметрыСозданияКоманды();
	ТекущаяКоманда.Имя = Имя;
	ТекущаяКоманда.Действие = Метод;
	
	ТекущийПоток = ТекущаяКоманда;
	
	Команда = Команды.Добавить();
	Команда.Имя = Имя;
	Команда.Параметры = ТекущаяКоманда;
	
	Возврат ЭтотОбъект;

КонецФункции // Команда()

// Устанавливает признак того что команда изменяет сохраняемые данные
//
// Параметры:
//    ИзменяетСохраняемыеДанные - Булево - признак
//
// Возвращаемое значение:
//    ОбработкаОбъект.ПостроительФорм - эта обработка для дальнейшего вызова функций в "текучем" стиле
//
Функция ИзменяетСохраняемыеДанные(ИзменяетСохраняемыеДанные) Экспорт
	
	Если Не ТипЗнч(ИзменяетСохраняемыеДанные) = Тип("Булево") Тогда
		ВызватьИсключение "ИзменяетСохраняемыеДанные: параметр ""ИзменяетСохраняемыеДанные"" должен иметь тип ""Булево""";
	КонецЕсли;
	Если Не ЭтоКоманда() Тогда
		ВызватьИсключение "ИзменяетСохраняемыеДанные: установка свойства ""ИзменяетСохраняемыеДанные""
			|доступно только для команд";
	КонецЕсли;

	Свойство("ИзменяетСохраняемыеДанные", ИзменяетСохраняемыеДанные);
	
	Возврат ЭтотОбъект;
	
КонецФункции

#КонецОбласти

#Область Элементы__Э

// Добавляет данные нового элемента формы
//
// Параметры:
//    Имя - Строка - имя элемента формы
//
// Возвращаемое значение:
//    ОбработкаОбъект.ПостроительФорм - эта обработка для дальнейшего вызова функций в "текучем" стиле
//
Функция ДобавитьЭлементФормы(Имя) Экспорт
	
	ПроверитьИмя(Имя, "ДобавитьЭлементФормы");

	ТекущийЭлемент = ПараметрыСозданияЭлементов();
	ТекущийЭлемент.Имя = Имя;
	
	ТекущийПоток = ТекущийЭлемент;
	
	Элемент = Элементы.Добавить();
	Элемент.Имя = Имя;
	Элемент.Параметры = ТекущийЭлемент;
	
	Возврат ЭтотОбъект;

КонецФункции // ДобавитьЭлементФормы()

// Добавляет данные нового поля ввода
//
// Параметры:
//    Имя - Строка - имя элемента формы
//
// Возвращаемое значение:
//    ОбработкаОбъект.ПостроительФорм - эта обработка для дальнейшего вызова функций в "текучем" стиле
//
Функция ПолеВвода(Имя) Экспорт

	ПроверитьИмя(Имя, "ПолеВвода");

	ДобавитьЭлементФормы(Имя);
	ТипЭлемента(Тип("ПолеФормы"));
	ВидЭлемента(ВидПоляФормы.ПолеВвода);
	
	Возврат ЭтотОбъект;

КонецФункции // ПолеВвода()

// Добавляет данные нового поля надписи
//
// Параметры:
//    Имя - Строка - имя элемента формы
//
// Возвращаемое значение:
//    ОбработкаОбъект.ПостроительФорм - эта обработка для дальнейшего вызова функций в "текучем" стиле
//
Функция ПолеНадписи(Имя) Экспорт

	ПроверитьИмя(Имя, "ПолеНадписи");

	ДобавитьЭлементФормы(Имя);
	ТипЭлемента(Тип("ПолеФормы"));
	ВидЭлемента(ВидПоляФормы.ПолеНадписи);
	
	Возврат ЭтотОбъект;

КонецФункции

// Добавляет данные нового поля флажка
//
// Параметры:
//    Имя - Строка - имя элемента формы
//
// Возвращаемое значение:
//    ОбработкаОбъект.ПостроительФорм - эта обработка для дальнейшего вызова функций в "текучем" стиле
//
Функция ПолеФлажка(Имя) Экспорт

	ПроверитьИмя(Имя, "ПолеФлажка");

	ДобавитьЭлементФормы(Имя);
	ТипЭлемента(Тип("ПолеФормы"));
	ВидЭлемента(ВидПоляФормы.ПолеФлажка);
	
	Возврат ЭтотОбъект;

КонецФункции

// Добавляет данные новой группы элеметов
//
// Параметры:
//    Имя - Строка - имя группы элементов
//
// Возвращаемое значение:
//    ОбработкаОбъект.ПостроительФорм - эта обработка для дальнейшего вызова функций в "текучем" стиле
//
Функция ГруппаФормы(Имя) Экспорт

	ПроверитьИмя(Имя, "ГруппаФормы");

	ДобавитьЭлементФормы(Имя);
	ТипЭлемента(Тип("ГруппаФормы"));
	ВидЭлемента(ВидГруппыФормы.ОбычнаяГруппа);
	
	Возврат ЭтотОбъект;

КонецФункции

// Добавляет данные новой группы страниц
//
// Параметры:
//    Имя - Строка - имя группы страниц
//
// Возвращаемое значение:
//    ОбработкаОбъект.ПостроительФорм - эта обработка для дальнейшего вызова функций в "текучем" стиле
//
Функция Страницы(Имя) Экспорт

	ПроверитьИмя(Имя, "Страницы");

	ДобавитьЭлементФормы(Имя);
	ТипЭлемента(Тип("ГруппаФормы"));
	ВидЭлемента(ВидГруппыФормы.Страницы);
	
	Возврат ЭтотОбъект;

КонецФункции

// Добавляет данные новой страницы в группе страниц
//
// Параметры:
//    Имя - Строка - имя страницы
//
// Возвращаемое значение:
//    ОбработкаОбъект.ПостроительФорм - эта обработка для дальнейшего вызова функций в "текучем" стиле
//
Функция Страница(Имя) Экспорт

	ПроверитьИмя(Имя, "Страница");

	// TODO: проконтролировать что родитель страницы задан и является группой
	//       страниц. Контролировать или при задании родителя (но в этот момент
	//       группа с видом "Страницы" могдет быть ещё не добавлена), либо, что
	//       кажется более верным, в момент финализации изменений формы

	ДобавитьЭлементФормы(Имя);
	ТипЭлемента(Тип("ГруппаФормы"));
	ВидЭлемента(ВидГруппыФормы.Страница);
	
	Возврат ЭтотОбъект;

КонецФункции

// Добавляет данные новой кнопки
//
// Параметры:
//    Имя - Строка - имя кнопки
//
// Возвращаемое значение:
//    ОбработкаОбъект.ПостроительФорм - эта обработка для дальнейшего вызова функций в "текучем" стиле
//
Функция Кнопка(Имя) Экспорт

	ПроверитьИмя(Имя, "Кнопка");

	ДобавитьЭлементФормы(Имя);
	ТипЭлемента(Тип("КнопкаФормы"));
	
	Возврат ЭтотОбъект;

КонецФункции

// Добавляет данные новой таблицы
//
// Параметры:
//    Имя - Строка - имя таблицы
//
// Возвращаемое значение:
//    ОбработкаОбъект.ПостроительФорм - эта обработка для дальнейшего вызова функций в "текучем" стиле
//
Функция ТаблицаФормы(Имя) Экспорт

	ПроверитьИмя(Имя, "ТаблицаФормы");

	ДобавитьЭлементФормы(Имя);
	ТипЭлемента(Тип("ТаблицаФормы"));

	Возврат ЭтотОбъект;

КонецФункции

// Добавляет данные новой командной панели
//
// Параметры:
//    Имя - Строка - имя командной панели
//
// Возвращаемое значение:
//    ОбработкаОбъект.ПостроительФорм - эта обработка для дальнейшего вызова функций в "текучем" стиле
//
Функция КоманднаяПанель(Имя) Экспорт

	ПроверитьИмя(Имя, "КоманднаяПанель");

	ДобавитьЭлементФормы(Имя);
	ТипЭлемента(Тип("ГруппаФормы"));
	ВидЭлемента(ВидГруппыФормы.КоманднаяПанель);
	
	Возврат ЭтотОбъект;

КонецФункции

// Добавляет данные новой надписи (декорации)
//
// Параметры:
//    Имя - Строка - имя надписи
//
// Возвращаемое значение:
//    ОбработкаОбъект.ПостроительФорм - эта обработка для дальнейшего вызова функций в "текучем" стиле
//
Функция Надпись(Имя) Экспорт

	ПроверитьИмя(Имя, "Надпись");

	ДобавитьЭлементФормы(Имя);
	ТипЭлемента(Тип("ДекорацияФормы"));
	ВидЭлемента(ВидДекорацииФормы.Надпись);
	
	Возврат ЭтотОбъект;

КонецФункции

#КонецОбласти

#Область Элементы_Свойства__С

// Устанавливает свойство элемента формы
//
// Параметры:
//    Имя      - Строка       - имя свойства элемента
//    Значение - Произвольный - значение свойства элемента
//
// Возвращаемое значение:
//    ОбработкаОбъект.ПостроительФорм - эта обработка для дальнейшего вызова функций в "текучем" стиле
//
Функция Свойство(Имя, Значение) Экспорт
	
	ПроверитьТекущийПоток();
	
	ТекущийПоток.Вставить(Имя, Значение);
	
	Возврат ЭтотОбъект;

КонецФункции // Свойство()

// Устанавливает тип элемента формы
//
// Параметры:
//    Тип - Тип - допустимые типы ПолеФормы, ГруппаФормы, КнопкаФормы, ТаблицаФормы, ДекорацияФормы
//
// Возвращаемое значение:
//    ОбработкаОбъект.ПостроительФорм - эта обработка для дальнейшего вызова функций в "текучем" стиле
//
Функция ТипЭлемента(Тип) Экспорт 

	ЭтоДопустимыйТип = Тип = Тип("ПолеФормы")
		Или Тип = Тип("ГруппаФормы")
		Или Тип = Тип("КнопкаФормы")
		Или Тип = Тип("ТаблицаФормы")
		Или Тип = Тип("ДекорацияФормы");
	Если Не ЭтоДопустимыйТип Тогда
		ВызватьИсключение "ТипЭлемента: передан недопустимый тип элемента";
	КонецЕсли;

	Свойство("Тип", Тип);
	
	Возврат ЭтотОбъект;

КонецФункции

// Устанавливает вид элемента формы
//
// Параметры:
//    Вид - ВидПоляФормы, ВидГруппыФормы, ВидДекорацииФормы - вид элемента
//
// Возвращаемое значение:
//    ОбработкаОбъект.ПостроительФорм - эта обработка для дальнейшего вызова функций в "текучем" стиле
//
Функция ВидЭлемента(Вид) Экспорт 

	Если ТекущийПоток = Неопределено Или ТекущийПоток.Тип = Неопределено Тогда
		ВызватьИсключение "ВидЭлемента: не задан тип элемента";
	КонецЕсли;
	Если Не ПроверитьВидЭлементаПоТипу(Вид) Тогда
		ВызватьИсключение СтрШаблон("ВидЭлемента: для типа %1 устанавливается некорректный вид элемента - %2",
			ТекущийПоток.Тип, Вид);
	КонецЕсли;

	Свойство("Вид", Вид);
	
	Возврат ЭтотОбъект;

КонецФункции

// Устанавливает место для последующего перемещения элемента (смена родителя) во время генерации
//
// Параметры:
//    Имя - Строка - имя элемента родителя
//
// Возвращаемое значение:
//    ОбработкаОбъект.ПостроительФорм - эта обработка для дальнейшего вызова функций в "текучем" стиле
//
Функция Переместить(Имя) Экспорт

	// TODO: Слегка не понял для чего отдельно ещё перемещать элемент во время генерации
	ПроверитьИмя(Имя, "Переместить");

	Свойство("Место", Имя);	
	
	Возврат ЭтотОбъект;

КонецФункции // Переместить()

// Добавляет обработчик события для элемента
//
// Параметры:
//    Имя   - Строка - наименование события
//    Метод - Строка - имя вызываемого метода обработчика события
//
// Возвращаемое значение:
//    ОбработкаОбъект.ПостроительФорм - эта обработка для дальнейшего вызова функций в "текучем" стиле
//
Функция Обработчик(Имя, Метод) Экспорт 

	ПроверитьТекущийЭлемент();
	// TODO: Контролировать наименования обработчиков в зависимости от типа элемента
	//       и корректность наименования метода

	ТекущийЭлемент.Обработчики.Вставить(Имя, Метод);
	
	Возврат ЭтотОбъект;

КонецФункции // ДобавитьОбработчик()

// Устанавливает признак вывода заголовка для элемента формы
//
// Параметры:
//    ОтображатьЗаголовок - Булево - признак необходимости вывода заголовка элемента
//
// Возвращаемое значение:
//    ОбработкаОбъект.ПостроительФорм - эта обработка для дальнейшего вызова функций в "текучем" стиле
//
Функция ОтображатьЗаголовок(ОтображатьЗаголовок) Экспорт 

	ИмяСвойства = "ОтображатьЗаголовок";
	ИмяТипа = "Булево";

	ПроверитьТипВходящегоПараметра(ОтображатьЗаголовок, ИмяСвойства, ИмяТипа);
	
	Свойство(ИмяСвойства, ОтображатьЗаголовок);
	
	Возврат ЭтотОбъект;

КонецФункции

// Устанавливает признак отображения данных поля ввода в режиме пароля
//
// Параметры:
//    РежимПароля - Булево, Неопределено - признак отображения данных поля ввода в режиме пароля
//
// Возвращаемое значение:
//    ОбработкаОбъект.ПостроительФорм - эта обработка для дальнейшего вызова функций в "текучем" стиле
//
Функция РежимПароля(РежимПароля) Экспорт 

	ИмяСвойства = "РежимПароля";

	МассивИменТипа = Новый Массив;
	МассивИменТипа.Добавить("Булево");
	МассивИменТипа.Добавить("Неопределено");
	
	ПроверитьТипВходящегоПараметра(РежимПароля, ИмяСвойства, МассивИменТипа);
	ПроверитьСвойствоДоступноТолькоДляПоляВвода(ИмяСвойства);

	Свойство(ИмяСвойства, РежимПароля);
	
	Возврат ЭтотОбъект;

КонецФункции

#КонецОбласти

#Область Элементы_Свойства_Автогенерация__С

Функция АвтоВводНезаполненного(АвтоВводНезаполненного) Экспорт 

	Свойство("АвтоВводНезаполненного", АвтоВводНезаполненного);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция АвтоВводНовойСтроки(АвтоВводНовойСтроки) Экспорт 

	Свойство("АвтоВводНовойСтроки", АвтоВводНовойСтроки);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция АвтоВысотаЯчейки(АвтоВысотаЯчейки) Экспорт 

	Свойство("АвтоВысотаЯчейки", АвтоВысотаЯчейки);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция АвтоМаксимальнаяВысота(АвтоМаксимальнаяВысота) Экспорт 

	Свойство("АвтоМаксимальнаяВысота", АвтоМаксимальнаяВысота);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция АвтоМаксимальнаяВысотаВСтрокахТаблицы(АвтоМаксимальнаяВысотаВСтрокахТаблицы) Экспорт 

	Свойство("АвтоМаксимальнаяВысотаВСтрокахТаблицы", АвтоМаксимальнаяВысотаВСтрокахТаблицы);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция АвтоМаксимальнаяШирина(АвтоМаксимальнаяШирина) Экспорт 

	Свойство("АвтоМаксимальнаяШирина", АвтоМаксимальнаяШирина);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция АвтоОтметкаНезаполненного(АвтоОтметкаНезаполненного) Экспорт 

	Свойство("АвтоОтметкаНезаполненного", АвтоОтметкаНезаполненного);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция АктивизироватьПоУмолчанию(АктивизироватьПоУмолчанию) Экспорт 

	Свойство("АктивизироватьПоУмолчанию", АктивизироватьПоУмолчанию);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ВажностьПриОтображении(ВажностьПриОтображении) Экспорт 

	Свойство("ВажностьПриОтображении", ВажностьПриОтображении);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ВариантУправленияВысотой(ВариантУправленияВысотой) Экспорт 

	Свойство("ВариантУправленияВысотой", ВариантУправленияВысотой);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ВертикальнаяПолосаПрокрутки(ВертикальнаяПолосаПрокрутки) Экспорт 

	Свойство("ВертикальнаяПолосаПрокрутки", ВертикальнаяПолосаПрокрутки);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ВертикальноеПоложение(ВертикальноеПоложение) Экспорт 

	Свойство("ВертикальноеПоложение", ВертикальноеПоложение);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ВертикальноеПоложениеВГруппе(ВертикальноеПоложениеВГруппе) Экспорт 

	Свойство("ВертикальноеПоложениеВГруппе", ВертикальноеПоложениеВГруппе);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ВертикальныеЛинии(ВертикальныеЛинии) Экспорт 

	Свойство("ВертикальныеЛинии", ВертикальныеЛинии);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция Вид(Вид) Экспорт 

	Свойство("Вид", Вид);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция Видимость(Видимость) Экспорт 

	Свойство("Видимость", Видимость);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция Вывод(Вывод) Экспорт 

	Свойство("Вывод", Вывод);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ВыделенныеСтроки(ВыделенныеСтроки) Экспорт 

	Свойство("ВыделенныеСтроки", ВыделенныеСтроки);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция Высота(Высота) Экспорт 

	Свойство("Высота", Высота);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ВысотаВСтрокахТаблицы(ВысотаВСтрокахТаблицы) Экспорт 

	Свойство("ВысотаВСтрокахТаблицы", ВысотаВСтрокахТаблицы);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ВысотаЗаголовка(ВысотаЗаголовка) Экспорт 

	Свойство("ВысотаЗаголовка", ВысотаЗаголовка);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ВысотаПодвала(ВысотаПодвала) Экспорт 

	Свойство("ВысотаПодвала", ВысотаПодвала);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ВысотаШапки(ВысотаШапки) Экспорт 

	Свойство("ВысотаШапки", ВысотаШапки);
	
	Возврат ЭтотОбъект;

КонецФункции

// Устанавливает признак отображения поля в виде гиперссылки
//
// Параметры:
//    Гиперссылка - Булево - 
//
// Возвращаемое значение:
//    ОбработкаОбъект.ПостроительФорм - эта обработка для дальнейшего вызова функций в "текучем" стиле
//
Функция Гиперссылка(Гиперссылка) Экспорт
	
	ИмяСвойства = "Гиперссылка";
	ИмяТипа = "Булево";

	ПроверитьТипВходящегоПараметра(Гиперссылка, ИмяСвойства, ИмяТипа);
	// TODO: Проверить тип элемента формы

	Свойство(ИмяСвойства, Гиперссылка);
	
	Возврат ЭтотОбъект;
	
КонецФункции

Функция ГиперссылкаЯчейки(ГиперссылкаЯчейки) Экспорт 

	Свойство("ГиперссылкаЯчейки", ГиперссылкаЯчейки);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ГоризонтальнаяПолосаПрокрутки(ГоризонтальнаяПолосаПрокрутки) Экспорт 

	Свойство("ГоризонтальнаяПолосаПрокрутки", ГоризонтальнаяПолосаПрокрутки);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ГоризонтальноеПоложение(ГоризонтальноеПоложение) Экспорт 

	Свойство("ГоризонтальноеПоложение", ГоризонтальноеПоложение);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ГоризонтальноеПоложениеВГруппе(ГоризонтальноеПоложениеВГруппе) Экспорт 

	Свойство("ГоризонтальноеПоложениеВГруппе", ГоризонтальноеПоложениеВГруппе);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ГоризонтальноеПоложениеВПодвале(ГоризонтальноеПоложениеВПодвале) Экспорт 

	Свойство("ГоризонтальноеПоложениеВПодвале", ГоризонтальноеПоложениеВПодвале);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ГоризонтальноеПоложениеВШапке(ГоризонтальноеПоложениеВШапке) Экспорт 

	Свойство("ГоризонтальноеПоложениеВШапке", ГоризонтальноеПоложениеВШапке);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ГоризонтальныеЛинии(ГоризонтальныеЛинии) Экспорт 

	Свойство("ГоризонтальныеЛинии", ГоризонтальныеЛинии);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция Группировка(Группировка) Экспорт 

	Свойство("Группировка", Группировка);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция Доступность(Доступность) Экспорт 

	Свойство("Доступность", Доступность);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция Заголовок(Заголовок) Экспорт 

	Свойство("Заголовок", Заголовок);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ЗапросОбновления(ЗапросОбновления) Экспорт 

	Свойство("ЗапросОбновления", ЗапросОбновления);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ИзменятьПорядокСтрок(ИзменятьПорядокСтрок) Экспорт 

	Свойство("ИзменятьПорядокСтрок", ИзменятьПорядокСтрок);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ИзменятьСоставСтрок(ИзменятьСоставСтрок) Экспорт 

	Свойство("ИзменятьСоставСтрок", ИзменятьСоставСтрок);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция Имя(Имя) Экспорт 

	Свойство("Имя", Имя);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ИмяКоманды(ИмяКоманды) Экспорт 

	Свойство("ИмяКоманды", ИмяКоманды);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ИспользованиеТекущейСтроки(ИспользованиеТекущейСтроки) Экспорт 

	Свойство("ИспользованиеТекущейСтроки", ИспользованиеТекущейСтроки);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция Картинка(Картинка) Экспорт 

	Свойство("Картинка", Картинка);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция КартинкаПодвала(КартинкаПодвала) Экспорт 

	Свойство("КартинкаПодвала", КартинкаПодвала);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция КартинкаСтрок(КартинкаСтрок) Экспорт 

	Свойство("КартинкаСтрок", КартинкаСтрок);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция КартинкаШапки(КартинкаШапки) Экспорт 

	Свойство("КартинкаШапки", КартинкаШапки);
	
	Возврат ЭтотОбъект;

КонецФункции

// Устанавливает признак наличия/отсутствия кнопки выбора значения в поле
//
// Параметры:
//    КнопкаВыбора - Булево, Неопределено - 
//
// Возвращаемое значение:
//    ОбработкаОбъект.ПостроительФорм - эта обработка для дальнейшего вызова функций в "текучем" стиле
//
Функция КнопкаВыбора(КнопкаВыбора) Экспорт 

	ИмяСвойства = "КнопкаВыбора";

	МассивИменТипа = Новый Массив;
	МассивИменТипа.Добавить("Булево");
	МассивИменТипа.Добавить("Неопределено");

	ПроверитьТипВходящегоПараметра(КнопкаВыбора, ИмяСвойства, МассивИменТипа);
	ПроверитьСвойствоДоступноТолькоДляПоляВвода(ИмяСвойства);

	Свойство("КнопкаВыбора", КнопкаВыбора);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция КнопкаПоУмолчанию(КнопкаПоУмолчанию) Экспорт 

	Свойство("КнопкаПоУмолчанию", КнопкаПоУмолчанию);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция КонтекстноеМеню(КонтекстноеМеню) Экспорт 

	Свойство("КонтекстноеМеню", КонтекстноеМеню);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция МаксимальнаяВысота(МаксимальнаяВысота) Экспорт 

	Свойство("МаксимальнаяВысота", МаксимальнаяВысота);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция МаксимальнаяВысотаВСтрокахТаблицы(МаксимальнаяВысотаВСтрокахТаблицы) Экспорт 

	Свойство("МаксимальнаяВысотаВСтрокахТаблицы", МаксимальнаяВысотаВСтрокахТаблицы);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция МаксимальнаяШирина(МаксимальнаяШирина) Экспорт 

	Свойство("МаксимальнаяШирина", МаксимальнаяШирина);
	
	Возврат ЭтотОбъект;

КонецФункции

// Устанавливает посимвольную строку маски интерактивного ввода текста в поле
//
// Параметры:
//    Маска - Строка - 
//
// Возвращаемое значение:
//    ОбработкаОбъект.ПостроительФорм - эта обработка для дальнейшего вызова функций в "текучем" стиле
//
Функция Маска(Маска) Экспорт
	
	ИмяСвойства = "Маска";
	ИмяТипа = "Строка";

	ПроверитьТипВходящегоПараметра(Маска, ИмяСвойства, ИмяТипа);
	ПроверитьСвойствоДоступноТолькоДляПоляВвода(ИмяСвойства);

	Свойство(ИмяСвойства, Маска);
	
	Возврат ЭтотОбъект;

КонецФункции

// Устанавливает признак отображения текста в многострочном режиме для поля ввода формы
//
// Параметры:
//    МногострочныйРежим - Булево, Неопределено - 
//
// Возвращаемое значение:
//    ОбработкаОбъект.ПостроительФорм - эта обработка для дальнейшего вызова функций в "текучем" стиле
//
Функция МногострочныйРежим(МногострочныйРежим) Экспорт 

	ИмяСвойства = "МногострочныйРежим";

	МассивИменТипа = Новый Массив;
	МассивИменТипа.Добавить("Булево");
	МассивИменТипа.Добавить("Неопределено");
	
	ПроверитьТипВходящегоПараметра(МногострочныйРежим, ИмяСвойства, МассивИменТипа);
	ПроверитьСвойствоДоступноТолькоДляПоляВвода(ИмяСвойства);

	Свойство(ИмяСвойства, МногострочныйРежим);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция МножественныйВыбор(МножественныйВыбор) Экспорт 

	Свойство("МножественныйВыбор", МножественныйВыбор);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция НачальноеОтображениеДерева(НачальноеОтображениеДерева) Экспорт 

	Свойство("НачальноеОтображениеДерева", НачальноеОтображениеДерева);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция НачальноеОтображениеСписка(НачальноеОтображениеСписка) Экспорт 

	Свойство("НачальноеОтображениеСписка", НачальноеОтображениеСписка);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ОграничениеТипа(ОграничениеТипа) Экспорт 

	Свойство("ОграничениеТипа", ОграничениеТипа);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ОтметкаНезаполненного(ОтметкаНезаполненного) Экспорт 

	Свойство("ОтметкаНезаполненного", ОтметкаНезаполненного);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ОтображатьВПодвале(ОтображатьВПодвале) Экспорт 

	Свойство("ОтображатьВПодвале", ОтображатьВПодвале);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ОтображатьВШапке(ОтображатьВШапке) Экспорт 

	Свойство("ОтображатьВШапке", ОтображатьВШапке);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция Отображение(Отображение) Экспорт 

	Свойство("Отображение", Отображение);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ОтображениеПодсказки(ОтображениеПодсказки) Экспорт 

	Свойство("ОтображениеПодсказки", ОтображениеПодсказки);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ОтображениеПредупрежденияПриРедактировании(ОтображениеПредупрежденияПриРедактировании) Экспорт 

	Свойство("ОтображениеПредупрежденияПриРедактировании", ОтображениеПредупрежденияПриРедактировании);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ОтображениеФигуры(ОтображениеФигуры) Экспорт 

	Свойство("ОтображениеФигуры", ОтображениеФигуры);
	
	Возврат ЭтотОбъект;

КонецФункции

// Устанавливает вариант отображения управления для группы формы
//
// Параметры:
//    ОтображениеУправления - ОтображениеУправленияОбычнойГруппы - 
//
// Возвращаемое значение:
//    ОбработкаОбъект.ПостроительФорм - эта обработка для дальнейшего вызова функций в "текучем" стиле
//
Функция ОтображениеУправления(ОтображениеУправления) Экспорт 
	
	ИмяСвойства = "ОтображениеУправления";
	ИмяТипа = "ОтображениеУправленияОбычнойГруппы";

	ПроверитьТипВходящегоПараметра(ОтображениеУправления, ИмяСвойства, ИмяТипа);
	ПроверитьСвойствоДоступноТолькоДляОбычнойГруппыФормы(ИмяСвойства);
	
	Свойство(ИмяСвойства, ОтображениеУправления);
	
	Возврат ЭтотОбъект;

КонецФункции

// Устанавливает массив параметров выбора элемента формы
//
// Параметры:
//    ПараметрыВыбора - ФиксированныйМассив Из ПараметрыВыбора - параметры выбора
//
// Возвращаемое значение:
//    ОбработкаОбъект.ПостроительФорм - эта обработка для дальнейшего вызова функций в "текучем" стиле
//
Функция ПараметрыВыбора(ПараметрыВыбора) Экспорт 

	ИмяСвойства = "ПараметрыВыбора";
	ИмяТипа = "ФиксированныйМассив";

	ПроверитьТипВходящегоПараметра(ПараметрыВыбора, ИмяСвойства, ИмяТипа);

	ВсеЭлементыИмеютКорректныйТип = Истина;
	Для каждого ЭлементМассива Из ПараметрыВыбора Цикл
		Если Не ТипЗнч(ЭлементМассива) = Тип("ПараметрыВыбора") Тогда
			ВсеЭлементыИмеютКорректныйТип = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если Не ВсеЭлементыИмеютКорректныйТип Тогда
		ВызватьИсключение СтрШаблон("%1: один или несколько элементов массива %1 имеют некорректный тип", ИмяСвойства);
	КонецЕсли;

	Свойство(ИмяСвойства, ПараметрыВыбора);
	
	Возврат ЭтотОбъект;

КонецФункции

// Устанавливает вариант поведения для группы формы
//
// Параметры:
//    Поведение - ПоведениеОбычнойГруппы - авто, всплывающая, обычная, свертываемая
//
// Возвращаемое значение:
//    ОбработкаОбъект.ПостроительФорм - эта обработка для дальнейшего вызова функций в "текучем" стиле
//
Функция Поведение(Поведение) Экспорт
	
	ИмяСвойства = "Поведение";
	ИмяТипа = "ПоведениеОбычнойГруппы";

	ПроверитьТипВходящегоПараметра(Поведение, ИмяСвойства, ИмяТипа);
	ПроверитьСвойствоДоступноТолькоДляОбычнойГруппыФормы(ИмяСвойства);
	
	Свойство(ИмяСвойства, Поведение);
	
	Возврат ЭтотОбъект;
	
КонецФункции

Функция ПоведениеПриНедоступностиОсновногоСервера(ПоведениеПриНедоступностиОсновногоСервера) Экспорт 

	Свойство("ПоведениеПриНедоступностиОсновногоСервера", ПоведениеПриНедоступностиОсновногоСервера);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ПоведениеПриСжатииПоГоризонтали(ПоведениеПриСжатииПоГоризонтали) Экспорт 

	Свойство("ПоведениеПриСжатииПоГоризонтали", ПоведениеПриСжатииПоГоризонтали);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция Подвал(Подвал) Экспорт 

	Свойство("Подвал", Подвал);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция Подсказка(Подсказка) Экспорт 

	Свойство("Подсказка", Подсказка);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ПодчиненныеЭлементы(ПодчиненныеЭлементы) Экспорт 

	Свойство("ПодчиненныеЭлементы", ПодчиненныеЭлементы);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ПоискПриВводе(ПоискПриВводе) Экспорт 

	Свойство("ПоискПриВводе", ПоискПриВводе);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ПоложениеВКоманднойПанели(ПоложениеВКоманднойПанели) Экспорт 

	Свойство("ПоложениеВКоманднойПанели", ПоложениеВКоманднойПанели);
	
	Возврат ЭтотОбъект;

КонецФункции

// Устанавливает вариант отображения заголовка для элемента формы
//
// Параметры:
//    ПоложениеЗаголовка - ПоложениеЗаголовкаЭлементаФормы - 
//
// Возвращаемое значение:
//    ОбработкаОбъект.ПостроительФорм - эта обработка для дальнейшего вызова функций в "текучем" стиле
//
Функция ПоложениеЗаголовка(ПоложениеЗаголовка) Экспорт 

	ИмяСвойства = "ПоложениеЗаголовка";
	ИмяТипа = "ПоложениеЗаголовкаЭлементаФормы";

	ПроверитьТипВходящегоПараметра(ПоложениеЗаголовка, ИмяСвойства, ИмяТипа);
	ПроверитьСвойствоДоступноТолькоДляЭлемента(ИмяСвойства);

	Свойство(ИмяСвойства, ПоложениеЗаголовка);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ПоложениеКартинки(ПоложениеКартинки) Экспорт 

	Свойство("ПоложениеКартинки", ПоложениеКартинки);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ПоложениеКоманднойПанели(ПоложениеКоманднойПанели) Экспорт 

	Свойство("ПоложениеКоманднойПанели", ПоложениеКоманднойПанели);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ПоложениеСостоянияПросмотра(ПоложениеСостоянияПросмотра) Экспорт 

	Свойство("ПоложениеСостоянияПросмотра", ПоложениеСостоянияПросмотра);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ПоложениеСтрокиПоиска(ПоложениеСтрокиПоиска) Экспорт 

	Свойство("ПоложениеСтрокиПоиска", ПоложениеСтрокиПоиска);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ПоложениеУправленияПоиском(ПоложениеУправленияПоиском) Экспорт 

	Свойство("ПоложениеУправленияПоиском", ПоложениеУправленияПоиском);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция Пометка(Пометка) Экспорт 

	Свойство("Пометка", Пометка);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ПредупреждениеПриРедактировании(ПредупреждениеПриРедактировании) Экспорт 

	Свойство("ПредупреждениеПриРедактировании", ПредупреждениеПриРедактировании);
	
	Возврат ЭтотОбъект;

КонецФункции

// Устанавливает необходимость пропуска поля при вводе данных
//
// Параметры:
//    ПропускатьПриВводе - Булево, Неопределено - 
//
// Возвращаемое значение:
//    ОбработкаОбъект.ПостроительФорм - эта обработка для дальнейшего вызова функций в "текучем" стиле
//
Функция ПропускатьПриВводе(ПропускатьПриВводе) Экспорт 

	ИмяСвойства = "ПропускатьПриВводе";

	МассивИменТипа = Новый Массив;
	МассивИменТипа.Добавить("Булево");
	МассивИменТипа.Добавить("Неопределено");

	ПроверитьТипВходящегоПараметра(ПропускатьПриВводе, ИмяСвойства, МассивИменТипа);
	ПроверитьСвойствоДоступноТолькоДляПоляВвода(ИмяСвойства);

	Свойство(ИмяСвойства, ПропускатьПриВводе);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ПутьКДанным(ПутьКДанным) Экспорт 

	Свойство("ПутьКДанным", ПутьКДанным);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ПутьКДаннымКартинкиСтроки(ПутьКДаннымКартинкиСтроки) Экспорт 

	Свойство("ПутьКДаннымКартинкиСтроки", ПутьКДаннымКартинкиСтроки);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ПутьКДаннымПодвала(ПутьКДаннымПодвала) Экспорт 

	Свойство("ПутьКДаннымПодвала", ПутьКДаннымПодвала);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция РазрешитьИзменениеСостава(РазрешитьИзменениеСостава) Экспорт 

	Свойство("РазрешитьИзменениеСостава", РазрешитьИзменениеСостава);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция РазрешитьНачалоПеретаскивания(РазрешитьНачалоПеретаскивания) Экспорт 

	Свойство("РазрешитьНачалоПеретаскивания", РазрешитьНачалоПеретаскивания);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция РазрешитьПеретаскивание(РазрешитьПеретаскивание) Экспорт 

	Свойство("РазрешитьПеретаскивание", РазрешитьПеретаскивание);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция РастягиватьПоВертикали(РастягиватьПоВертикали) Экспорт 

	Свойство("РастягиватьПоВертикали", РастягиватьПоВертикали);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция РастягиватьПоГоризонтали(РастягиватьПоГоризонтали) Экспорт 

	Свойство("РастягиватьПоГоризонтали", РастягиватьПоГоризонтали);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция РасширеннаяПодсказка(РасширеннаяПодсказка) Экспорт 

	Свойство("РасширеннаяПодсказка", РасширеннаяПодсказка);
	
	Возврат ЭтотОбъект;

КонецФункции

// Устанавливает возможность включения расширенного режима редактирования, при котором
// само поле ввода обрабатывает нажатие клавиши TAB 
//
// Параметры:
//    РасширенноеРедактирование - Булево, Неопределено - 
//
// Возвращаемое значение:
//    ОбработкаОбъект.ПостроительФорм - эта обработка для дальнейшего вызова функций в "текучем" стиле
//
Функция РасширенноеРедактирование(РасширенноеРедактирование) Экспорт 

	ИмяСвойства = "РасширенноеРедактирование";

	МассивИменТипа = Новый Массив;
	МассивИменТипа.Добавить("Булево");
	МассивИменТипа.Добавить("Неопределено");

	ПроверитьТипВходящегоПараметра(РасширенноеРедактирование, ИмяСвойства, МассивИменТипа);
	ПроверитьСвойствоДоступноТолькоДляПоляВвода(ИмяСвойства);

	Свойство(ИмяСвойства, РасширенноеРедактирование);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция РежимВводаСтрок(РежимВводаСтрок) Экспорт 

	Свойство("РежимВводаСтрок", РежимВводаСтрок);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция РежимВыбора(РежимВыбора) Экспорт 

	Свойство("РежимВыбора", РежимВыбора);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция РежимВыделения(РежимВыделения) Экспорт 

	Свойство("РежимВыделения", РежимВыделения);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция РежимВыделенияСтроки(РежимВыделенияСтроки) Экспорт 

	Свойство("РежимВыделенияСтроки", РежимВыделенияСтроки);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция РежимРедактирования(РежимРедактирования) Экспорт 

	Свойство("РежимРедактирования", РежимРедактирования);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция Родитель(Родитель) Экспорт 

	Свойство("Родитель", Родитель);
	
	Возврат ЭтотОбъект;

КонецФункции

// Устанавливает сквозное выравнивание заголовков элементов группы
//
// Параметры:
//    СквозноеВыравнивание - СквозноеВыравнивание - вариант внешнего выравнивания элементов
//
// Возвращаемое значение:
//    ОбработкаОбъект.ПостроительФорм - эта обработка для дальнейшего вызова функций в "текучем" стиле
//
Функция СквозноеВыравнивание(СквозноеВыравнивание) Экспорт 

	ИмяСвойства = "СквозноеВыравнивание";
	ИмяТипа = "СквозноеВыравнивание";

	ПроверитьТипВходящегоПараметра(СквозноеВыравнивание, ИмяСвойства, ИмяТипа);
	ПроверитьСвойствоДоступноТолькоДляОбычнойГруппыФормы(ИмяСвойства);

	Свойство(ИмяСвойства, СквозноеВыравнивание);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция СостояниеПросмотра(СостояниеПросмотра) Экспорт 

	Свойство("СостояниеПросмотра", СостояниеПросмотра);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция СочетаниеКлавиш(СочетаниеКлавиш) Экспорт 

	Свойство("СочетаниеКлавиш", СочетаниеКлавиш);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция СпособПеретаскиванияФайлов(СпособПеретаскиванияФайлов) Экспорт 

	Свойство("СпособПеретаскиванияФайлов", СпособПеретаскиванияФайлов);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция СтрокаПоиска(СтрокаПоиска) Экспорт 

	Свойство("СтрокаПоиска", СтрокаПоиска);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ТекстПодвала(ТекстПодвала) Экспорт 

	Свойство("ТекстПодвала", ТекстПодвала);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ТекущаяСтрока(ТекущаяСтрока) Экспорт 

	Свойство("ТекущаяСтрока", ТекущаяСтрока);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ТекущиеДанные(ТекущиеДанные) Экспорт 

	Свойство("ТекущиеДанные", ТекущиеДанные);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ТекущийРодитель(ТекущийРодитель) Экспорт 

	Свойство("ТекущийРодитель", ТекущийРодитель);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ТолькоВоВсехДействиях(ТолькоВоВсехДействиях) Экспорт 

	Свойство("ТолькоВоВсехДействиях", ТолькоВоВсехДействиях);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ТолькоПросмотр(ТолькоПросмотр) Экспорт 

	Свойство("ТолькоПросмотр", ТолькоПросмотр);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция УникальностьКоманды(УникальностьКоманды) Экспорт 

	Свойство("УникальностьКоманды", УникальностьКоманды);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция УправлениеПоиском(УправлениеПоиском) Экспорт 

	Свойство("УправлениеПоиском", УправлениеПоиском);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция Фигура(Фигура) Экспорт 

	Свойство("Фигура", Фигура);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ФиксацияВТаблице(ФиксацияВТаблице) Экспорт 

	Свойство("ФиксацияВТаблице", ФиксацияВТаблице);
	
	Возврат ЭтотОбъект;

КонецФункции

// Устанавливает форматную строку для текста или текстового представления значения типа булево (флажок, тумблер)
//
// Параметры:
//    ФорматРедактирования - Строка - 
//
// Возвращаемое значение:
//    ОбработкаОбъект.ПостроительФорм - эта обработка для дальнейшего вызова функций в "текучем" стиле
//
Функция ФорматРедактирования(ФорматРедактирования) Экспорт 

	ИмяСвойства = "ФорматРедактирования";
	ИмяТипа = "Строка";

	ПроверитьТипВходящегоПараметра(ФорматРедактирования, ИмяСвойства, ИмяТипа);
	ПроверитьСвойствоДоступноТолькоДляЭлемента(ИмяСвойства);
	Если Не ТекущийПоток.Тип = Тип("ПолеФормы")
		Или Не (ТекущийПоток.Вид = ВидПоляФормы.ПолеВвода Или ТекущийПоток.Вид = ВидПоляФормы.ПолеФлажка)
	Тогда
		ВызватьИсключение СтрШаблон("%1 %2: установка свойства ""%1"" доступно только для поля ввода формы",
			ИмяСвойства, ИмяТекущегоЭлемента());
	КонецЕсли;

	Свойство(ИмяСвойства, ФорматРедактирования);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ЦветРамки(ЦветРамки) Экспорт 

	Свойство("ЦветРамки", ЦветРамки);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ЦветТекста(ЦветТекста) Экспорт 

	Свойство("ЦветТекста", ЦветТекста);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ЦветТекстаЗаголовка(ЦветТекстаЗаголовка) Экспорт 

	Свойство("ЦветТекстаЗаголовка", ЦветТекстаЗаголовка);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ЦветТекстаПодвала(ЦветТекстаПодвала) Экспорт 

	Свойство("ЦветТекстаПодвала", ЦветТекстаПодвала);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ЦветФона(ЦветФона) Экспорт 

	Свойство("ЦветФона", ЦветФона);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ЦветФонаЗаголовка(ЦветФонаЗаголовка) Экспорт 

	Свойство("ЦветФонаЗаголовка", ЦветФонаЗаголовка);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ЦветФонаПодвала(ЦветФонаПодвала) Экспорт 

	Свойство("ЦветФонаПодвала", ЦветФонаПодвала);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ЧередованиеЦветовСтрок(ЧередованиеЦветовСтрок) Экспорт 

	Свойство("ЧередованиеЦветовСтрок", ЧередованиеЦветовСтрок);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция Шапка(Шапка) Экспорт 

	Свойство("Шапка", Шапка);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция Ширина(Ширина) Экспорт 

	Свойство("Ширина", Ширина);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция Шрифт(Шрифт) Экспорт 

	Свойство("Шрифт", Шрифт);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ШрифтЗаголовка(ШрифтЗаголовка) Экспорт 

	Свойство("ШрифтЗаголовка", ШрифтЗаголовка);
	
	Возврат ЭтотОбъект;

КонецФункции

Функция ШрифтПодвала(ШрифтПодвала) Экспорт 

	Свойство("ШрифтПодвала", ШрифтПодвала);
	
	Возврат ЭтотОбъект;

КонецФункции

#КонецОбласти

#Область Вспомогательные

Функция ТекущийЭлемент(Имя) Экспорт 

	Элемент = Элементы.Найти(Имя, "Имя");
	
	Если Элемент = Неопределено Тогда
		
		ЭлементФормы = Форма.Элементы.Найти(Имя);
		
		Если ЭлементФормы = Неопределено Тогда
			ВызватьИсключение "Элемент не найден " + Имя;
		Иначе
			
			ТекущийЭлемент = ПараметрыСозданияЭлементов();
			ТекущийЭлемент.Имя = Имя;
	
			Элемент = Элементы.Добавить();
			Элемент.Имя = Имя;
			Элемент.Параметры = ТекущийЭлемент;
			Элемент.ЭлементФормы = ЭлементФормы;
			
		КонецЕсли;
	Иначе
		ТекущийЭлемент = Элемент.Параметры;	
	КонецЕсли;
	
	ТекущийПоток = ТекущийЭлемент;
	
	Возврат ЭтотОбъект;

КонецФункции // ТекущийЭлемент

Функция ТекущаяКоманда(Имя) Экспорт 

	Команда = Команды.Найти(Имя, "Имя");
	
	Если Команда = Неопределено Тогда
		
		КомандаФормы = Форма.Команды.Найти(Имя);
		
		Если КомандаФормы = Неопределено Тогда
			ВызватьИсключение "Команда не найдена " + Имя;
		Иначе
			
			ТекущаяКоманда = ПараметрыСозданияКоманды();
			ТекущаяКоманда.Имя = Имя;
	
			Элемент = Команды.Добавить();
			Элемент.Имя = Имя;
			Элемент.Параметры = ТекущийЭлемент;
			Элемент.КомандаФормы = КомандаФормы;
			
		КонецЕсли;
	Иначе
		ТекущийЭлемент = Элемент.Параметры;
	КонецЕсли;
	
	ТекущийПоток = ТекущийЭлемент;
	
	Возврат ЭтотОбъект;

КонецФункции // ТекущийЭлемент

Функция ПутьРеквизита(_ПутьРеквизита = "") Экспорт 

	ПутьРеквизита = _ПутьРеквизита;
	
	Возврат ЭтотОбъект;

КонецФункции // ПутьРеквизита()

Функция Применить() Экспорт 

	СоздатьРеквизиты();
	СоздатьКоманды();
	СоздатьЭлементы();
	
	Возврат ЭтотОбъект;

КонецФункции // Применить()

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализацияКомпонентов()

	Компоненты = Новый Структура;
	
	Префикс = ПрефиксПодсистемы();
	ИмяЭтойОбработки = Метаданные().Имя;
	
	Для Каждого ОбработкаИзКонфигурации из Метаданные.Обработки Цикл
		ИмяОбработки = ОбработкаИзКонфигурации.Имя;
		Если НЕ ИмяОбработки  = ИмяЭтойОбработки И СтрНачинаетсяС(ИмяОбработки, Префикс) Тогда
			ОбработкаОбъект = Обработки[ИмяОбработки].Создать();
			ОбработкаОбъект.Инициализация(ЭтотОбъект);
			Компоненты.Вставить(СтрЗаменить(ИмяОбработки, Префикс, ""), ОбработкаОбъект);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция ПрефиксПодсистемы()

	Возврат "рсф_"; // Работа С Формами

КонецФункции // ПрефиксПодсистемы()

Функция СоздатьЭлементы() 

	Для Каждого Элемент из Элементы Цикл
		Если Не Элемент.Обработан = Истина Тогда 
			СоздатьЭлемент(Элемент);		
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаЭлементов();
	
	Возврат ЭтотОбъект;

КонецФункции // СоздатьЭлементы()

Функция СоздатьЭлемент(Элемент)
	
	ПараметрыСоздания = Элемент.Параметры;
	
	Если ЗначениеЗаполнено(ПараметрыСоздания.Родитель) Тогда
		Родитель = НайтиЭлемент(ПараметрыСоздания.Родитель);	
	ИначеЕсли Элемент.ЭлементФормы <> Неопределено Тогда
		Родитель = Элемент.ЭлементФормы.Родитель;
	Иначе 
		Родитель = Форма;	
	КонецЕсли;
	
	Место = НайтиЭлемент(ПараметрыСоздания.Место);
	
	Если Элемент.ЭлементФормы = Неопределено Тогда
		НовыйЭлемент = Форма.Элементы.Добавить(ПараметрыСоздания.Имя, ПараметрыСоздания.Тип, Родитель);
	Иначе 
		НовыйЭлемент = Элемент.ЭлементФормы;
	КонецЕсли;
		
	Если не ПараметрыСоздания.Вид = Неопределено Тогда
		НовыйЭлемент.Вид = ПараметрыСоздания.Вид;
	КонецЕсли;
	
	Если не ПараметрыСоздания.ПутьКДанным = Неопределено Тогда
		НовыйЭлемент.ПутьКДанным = ПараметрыСоздания.ПутьКДанным;
	КонецЕсли;
	
	Если не Место = Неопределено Тогда
		Форма.Элементы.Переместить(НовыйЭлемент, Родитель, Место); 
	КонецЕсли;
	
	Для Каждого Обработчик из ПараметрыСоздания.Обработчики цикл
		НовыйЭлемент.УстановитьДействие(Обработчик.Ключ, Обработчик.Значение);	
	КонецЦикла;
	
	//Прочие свойства
	СтандартныеСвойства = ПараметрыСозданияЭлементов();
	Для Каждого ТекСвойство из ПараметрыСоздания Цикл
		Если СтандартныеСвойства.Свойство(ТекСвойство.Ключ) = Ложь Тогда
			ПрисвоитьСвойство(НовыйЭлемент, ТекСвойство);
		КонецЕсли;
	КонецЦикла;
	
	Элемент.ЭлементФормы = НовыйЭлемент;
	Элемент.Обработан = Истина;
	
	Возврат НовыйЭлемент;
	
КонецФункции

Процедура ПрисвоитьСвойство(ТекЭлемент, ТекСвойство)
	
	Если ТипЗнч(ТекСвойство.Значение) = Тип("СписокЗначений") Тогда
		ТекЭлемент[ТекСвойство.Ключ].Очистить();
		Для Каждого ТекЭлементСписка Из ТекСвойство.Значение Цикл
			ТекЭлемент[ТекСвойство.Ключ].Добавить(
				ТекЭлементСписка.Значение, 
				ТекЭлементСписка.Представление, 
				ТекЭлементСписка.Пометка);
		КонецЦикла;
	Иначе
		ТекЭлемент[ТекСвойство.Ключ] = ТекСвойство.Значение;
	КонецЕсли;
	
КонецПроцедуры

Функция НайтиЭлемент(Имя)
	
	Если не ЗначениеЗаполнено(Имя) Тогда
		Возврат Неопределено;
	КонецЕсли;

	//Сначала будем искать в существующих элементах формы
	Результат = Форма.Элементы.Найти(Имя);
	Если не Результат = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	//Ищем в программных элементах
	ПрограммныйЭлемент = Элементы.Найти(Имя, "Имя");
	
	Если ПрограммныйЭлемент = Неопределено Тогда
		ВызватьИсключение СтрШаблон("Элемент ""%1"" не найден", Имя);	
	КонецЕсли;
	
	Если ПрограммныйЭлемент.ЭлементФормы = Неопределено Тогда
		Возврат СоздатьЭлемент(ПрограммныйЭлемент);	
	Иначе
		Возврат ПрограммныйЭлемент.ЭлементФормы;	
	КонецЕсли;

КонецФункции // НайтиЭлемент()

Процедура ТаблицаЭлементов()

	Элементы = Новый ТаблицаЗначений;
	Элементы.Колонки.Добавить("Имя");
	Элементы.Колонки.Добавить("ЭлементФормы");
	Элементы.Колонки.Добавить("Параметры");
	Элементы.Колонки.Добавить("Обработан");

КонецПроцедуры

Функция ПараметрыСозданияЭлементов() 
	
	Результат = Новый Структура;
	
	Результат.Вставить("Имя");
	Результат.Вставить("Тип");
	Результат.Вставить("Родитель");
	Результат.Вставить("Место");
	Результат.Вставить("ПутьКДанным");
	Результат.Вставить("Вид");
	Результат.Вставить("Обработчики", Новый Структура);
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьТекущийЭлемент()

	Если ТекущийЭлемент = Неопределено Тогда
		ВызватьИсключение "Элемент не инициализирован";
	КонецЕсли;
	
	Если НЕ ТекущийЭлемент = ТекущийПоток Тогда
		ВызватьИсключение "Обработчик не применим к команде";
	КонецЕсли;

КонецПроцедуры

Функция СоздатьКоманды()
	
	Для Каждого Команда из Команды Цикл
		Если Не Команда.Обработан = Истина Тогда 
			СоздатьКоманду(Команда);
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаКоманд();
	
	Возврат ЭтотОбъект;

КонецФункции // СоздатьКоманды()

Функция СоздатьКоманду(Команда)
	
	ПараметрыСоздания = Команда.Параметры;
	
	Если Команда.КомандаФормы = Неопределено Тогда
		НоваяКоманда = Форма.Команды.Добавить(Команда.Имя);
		НоваяКоманда.Заголовок = ПараметрыСоздания.Заголовок;
		НоваяКоманда.Действие = ПараметрыСоздания.Действие;
	Иначе
		НоваяКоманда = Команда.КомандаФормы; 
	КонецЕсли;
	
	Если Не ПараметрыСоздания.ИзменяетСохраняемыеДанные = Неопределено Тогда
		НоваяКоманда.ИзменяетСохраняемыеДанные = ПараметрыСоздания.ИзменяетСохраняемыеДанные;
	КонецЕсли;
	
	Если Не ПараметрыСоздания.Картинка = Неопределено Тогда
		НоваяКоманда.Картинка = ПараметрыСоздания.Картинка;
	КонецЕсли;
	
	Если Не ПараметрыСоздания.Подсказка = Неопределено Тогда
		НоваяКоманда.Подсказка = ПараметрыСоздания.Подсказка;
	КонецЕсли;
	
	Если Не ПараметрыСоздания.СочетаниеКлавиш = Неопределено Тогда
		НоваяКоманда.СочетаниеКлавиш = ПараметрыСоздания.СочетаниеКлавиш;
	КонецЕсли;
	
	//Прочие свойства
	СтандартныеСвойства = ПараметрыСозданияКоманды();
	Для Каждого ТекСвойство из ПараметрыСоздания Цикл
		Если СтандартныеСвойства.Свойство(ТекСвойство.Ключ) = Ложь Тогда
			НоваяКоманда[ТекСвойство.Ключ] = ТекСвойство.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Команда.КомандаФормы = НоваяКоманда;
	Команда.Обработан = Истина;
	
	Возврат НоваяКоманда;
	
КонецФункции

Процедура ТаблицаКоманд()

	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Имя");
	Команды.Колонки.Добавить("КомандаФормы");
	Команды.Колонки.Добавить("Параметры");
	Команды.Колонки.Добавить("Обработан");

КонецПроцедуры

Функция ПараметрыСозданияКоманды() 
	
	Результат = Новый Структура;
	
	Результат.Вставить("Имя");
	Результат.Вставить("Действие");
	Результат.Вставить("ИзменяетСохраняемыеДанные");
	Результат.Вставить("Заголовок");
	Результат.Вставить("Картинка");
	Результат.Вставить("Подсказка");
	Результат.Вставить("СочетаниеКлавиш");
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьТекущийПоток()

	Если ТекущийПоток = Неопределено Тогда
		ВызватьИсключение "Элемент не инициализирован";
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьИмя(Имя, ИмяФункции)

	Если Не ТипЗнч(Имя) = Тип("Строка") Тогда
		ВызватьИсключение СтрШаблон("%1: параметр ""Имя"" должен быть строкового типа", ИмяФункции);
	КонецЕсли;
	Если ПустаяСтрока(Имя) Тогда
		ВызватьИсключение СтрШаблон("%1: параметр ""Имя"" должен быть заполнен", ИмяФункции);
	КонецЕсли;
	Если Не ПроверитьНаименованиеЭлемента(Имя) Тогда
		ВызватьИсключение СтрШаблон("%1: передан параметр ""Имя"" некорректного формата - ""%2""",
			ИмяФункции, Имя);
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьТипВходящегоПараметра(Параметр, ИмяСвойства, ИмяТипа)

	ТекстИключения = СтрШаблон("%1 %2: тип переданного параметра параметра должен быть ""%3""",
		ИмяСвойства, ИмяТекущегоЭлемента(), ИмяТипа);

	Если ТипЗнч(ИмяТипа) = Тип("Строка") Тогда
		Если Не ТипЗнч(Параметр) = Тип(ИмяТипа) Тогда
			ВызватьИсключение ТекстИключения;
		КонецЕсли;
	Иначе // массив
		ТипПараметраВходитВМассив = Ложь;
		Для каждого ЭлементМассива Из ИмяТипа Цикл
			Если ТипЗнч(Параметр) = Тип(ЭлементМассива) Тогда
				ТипПараметраВходитВМассив = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если Не ТипПараметраВходитВМассив Тогда
			ВызватьИсключение ТекстИключения;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьСвойствоДоступноТолькоДляЭлемента(Имя)

	Если Не ЭтоЭлемент() Тогда
		ВызватьИсключение СтрШаблон("%1 %2: установка свойства ""%1"" доступно только для элементов форм",
			Имя, ИмяТекущегоЭлемента());
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьСвойствоДоступноТолькоДляОбычнойГруппыФормы(Имя)
	
	ПроверитьСвойствоДоступноТолькоДляЭлемента(Имя);
	Если Не ТекущийПоток.Тип = Тип("ГруппаФормы") Или Не ТекущийПоток.Вид = ВидГруппыФормы.ОбычнаяГруппа Тогда
		ВызватьИсключение СтрШаблон("%1 %2: установка свойства ""%1"" доступно только для обычных групп форм",
			Имя, ИмяТекущегоЭлемента());
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьСвойствоДоступноТолькоДляПоляВвода(Имя)

	ПроверитьСвойствоДоступноТолькоДляЭлемента(Имя);
	Если Не ТекущийПоток.Тип = Тип("ПолеФормы") Или Не ТекущийПоток.Вид = ВидПоляФормы.ПолеВвода Тогда
		ВызватьИсключение СтрШаблон("%1 %2: установка свойства ""%1"" доступно только для поля ввода формы",
			Имя, ИмяТекущегоЭлемента());
	КонецЕсли;

КонецПроцедуры

Функция ЭтоОбъектСсылочногоТипа(ИмяОбъекта)
	
	Позиция = СтрНайти(ИмяОбъекта, ".");
	Если Позиция > 0 Тогда 
		ИмяБазовогоТипа = Лев(ИмяОбъекта, Позиция - 1);
		Возврат ИмяБазовогоТипа = "СправочникСсылка"
			Или ИмяБазовогоТипа = "ДокументСсылка"
			Или ИмяБазовогоТипа = "БизнесПроцессСсылка"
			Или ИмяБазовогоТипа = "ЗадачаСсылка"
			Или ИмяБазовогоТипа = "ПланСчетовСсылка"
			Или ИмяБазовогоТипа = "ПланОбменаСсылка"
			Или ИмяБазовогоТипа = "ПланВидовХарактеристикСсылка"
			Или ИмяБазовогоТипа = "ПланВидовРасчетаСсылка";
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ПроверитьВидЭлементаПоТипу(Вид)

	Если ТекущийПоток.Тип = Тип("КнопкаФормы") Или ТекущийПоток.Тип = Тип("ТаблицаФормы") Тогда
		Возврат Ложь;
	ИначеЕсли ТекущийПоток.Тип = Тип("ПолеФормы") Тогда
		Если ТипЗнч(Вид) = Тип("ВидПоляФормы") Тогда
			Возврат Истина;
		КонецЕсли;
		
		Возврат Ложь;
	ИначеЕсли ТекущийПоток.Тип = Тип("ГруппаФормы") Тогда
		Если ТипЗнч(Вид) = Тип("ВидГруппыФормы") Тогда
			Возврат Истина;
		КонецЕсли;
		
		Возврат Ложь;
	ИначеЕсли ТекущийПоток.Тип = Тип("ДекорацияФормы") Тогда
		Если ТипЗнч(Вид) = Тип("ВидДекорацииФормы") Тогда
			Возврат Истина;
		КонецЕсли;
		
		Возврат Ложь;
	Иначе
		ВызватьИсключение СтрШаблон("ПроверитьВидЭлементаПоТипу: неизвестный тип элемента формы - %1",
			ТекущийПоток.Тип);
	КонецЕсли;
	
КонецФункции

Функция ПроверитьНаименованиеЭлемента(Имя)
	
	ПервыеСимволы = "abcdefghijklmnopqrstuvwxyzабвгдеёжзийклмнопрстуфхцчшщъыьэюя_";
	ОстальныеСимволы = ПервыеСимволы + "0123456789";
	
	Если СтрНайти(ПервыеСимволы, НРег(Лев(Имя, 1))) = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	Для Сч = 2 По СтрДлина(Имя) Цикл
		Если СтрНайти(ОстальныеСимволы, НРег(Сред(Имя, Сч, 1))) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ЭтоЭлемент()

	Возврат Не ТекущийПоток = Неопределено
		И Не ТекущийПоток.Свойство("Действие");

КонецФункции

Функция ЭтоКоманда()

	Возврат Не ТекущийПоток = Неопределено
		И ТекущийПоток.Свойство("Действие");

КонецФункции

Функция ИмяТекущегоЭлемента()

	Если Не ТекущийПоток = Неопределено Тогда
		Возврат ТекущийПоток.Имя;
	КонецЕсли;

	Возврат "";

КонецФункции

#КонецОбласти
