
#Область  СлужебныйПрограммныйИнтерфейс

#Область ОбъявлениеТестов

Процедура ИсполняемыеСценарии() Экспорт

	ЮТТесты
		.ДобавитьТестовыйНабор("formhelper: ПолеВвода (строка)")
			.ДобавитьТест("ПолеВводаСтрока_Успшный")
		.ДобавитьТестовыйНабор("formhelper: ГруппаФормы")
			.ДобавитьТест("ГруппаФормы_Успшный")
	;

КонецПроцедуры

#КонецОбласти

#Область События

Процедура ПослеКаждогоТеста() Экспорт
	
	_Форма = ЮТест.Контекст().Значение("_Форма");
	_Форма.Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область Тесты

Процедура ПолеВводаСтрока_Успшный() Экспорт
	
	// Подготовка
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТекстТеста", "
	|РаботаСФормамиСервер.НовыйПостроительФорм(ЭтаФорма)
	|	//
	|	.ПолеВвода(""ТестоваяПолеСтрока"")
	|		.ПутьКДанным(""Объект.ТестоваяПолеСтрока"")
	|		.Заголовок(""Тестовое поле (строка)"")
	|		.ПоложениеЗаголовка(ПоложениеЗаголовкаЭлементаФормы.Верх)
	|		.Видимость(Истина)
	|		.Доступность(Истина)
	|		.ТолькоПросмотр(Истина)
	|		.ПропускатьПриВводе(Истина)
	|		.АктивизироватьПоУмолчанию(Истина)
	|		.ВажностьПриОтображении(ВажностьПриОтображении.Высокая)
	|		.ПоведениеПриНедоступностиОсновногоСервера(ПоведениеПриНедоступностиОсновногоСервера.ОтключитьДоступность)
	|		.Маска(""99-99"")
	|		.РежимПароля(Ложь)
	|		.МногострочныйРежим(Истина)
	|		.РасширенноеРедактирование(Истина)
	|
	|	// Финализируем изменения
	|	.Применить()
	|;");
	
	// Выполнение
	_Форма = ОткрытьФорму("Обработка.рсф_ТестоваяОбработка.Форма",
		СтруктураПараметров);
	ЮТест.Контекст().УстановитьЗначение("_Форма", _Форма);

	// Проверки
	ЮТест.ОжидаетЧто(_Форма.Элементы)
		.Содержит(
			ЮТест.Предикат()
				.Реквизит("Имя")
					.Равно("ТестоваяПолеСтрока")
		)
	;
	ЮТест.ОжидаетЧто(_Форма.Элементы["ТестоваяПолеСтрока"])
		// ПутьКДанным на клиенте недоступно. Не проверяем
		//.Свойство("ПутьКДанным").Равно("Объект.ТестоваяПолеСтрока")
		
		.Свойство("Заголовок").Равно("Тестовое поле (строка)")
		.Свойство("Вид").Равно(ВидПоляФормы.ПолеВвода)
		.Свойство("ПоложениеЗаголовка").Равно(ПоложениеЗаголовкаЭлементаФормы.Верх)
		.Свойство("Видимость").Равно(Истина)
		.Свойство("Доступность").Равно(Истина)
		.Свойство("ТолькоПросмотр").Равно(Истина)
		.Свойство("ПропускатьПриВводе").Равно(Истина)
		.Свойство("АктивизироватьПоУмолчанию").Равно(Истина)
		
		// Поле имеет смысл для мобильного клиента или сервера. На клиенте перечисление недоступно
		//.Свойство("ВажностьПриОтображении").Равно(ВажностьПриОтображении.Высокая)
		
		// Поле имеет смысл для мобильного клиента или автономного сервера. На клиенте перечисление недоступно
		//.Свойство("ПоведениеПриНедоступностиОсновногоСервера")
		//	.Равно(ПоведениеПриНедоступностиОсновногоСервера.ОтключитьДоступность)
		
		.Свойство("Маска").Равно("99-99")
		.Свойство("РежимПароля").Равно(Ложь)
		.Свойство("МногострочныйРежим").Равно(Истина)
		.Свойство("РасширенноеРедактирование").Равно(Истина)
	;
	
КонецПроцедуры

Процедура ГруппаФормы_Успшный() Экспорт

	// Подготовка
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТекстТеста", "");

	// Выполнение
	_Форма = ОткрытьФорму("Обработка.рсф_ТестоваяОбработка.Форма",
		СтруктураПараметров);
	ЮТест.Контекст().УстановитьЗначение("_Форма", _Форма);

	// Проверки

КонецПроцедуры

#КонецОбласти

#КонецОбласти
