
Функция ОписаниеТаблицы(Имя, Заголовок, Родитель, ПереопределитьКоманднуюПанель = Ложь) Экспорт 

	Возврат Новый Структура("Имя, Заголовок, Родитель, ПереопределитьКоманднуюПанель, Реквизиты",
							Имя, Заголовок, Родитель, ПереопределитьКоманднуюПанель, Новый Массив);

КонецФункции // ОписаниеТаблицы()
						
Функция ОписаниеРеквизитаТаблицы(Имя, Заголовок, Тип)  Экспорт 

	Возврат Новый Структура("Имя, Заголовок, Тип",
							Имя, Заголовок, Тип)
							
КонецФункции // ОписаниеРеквизитаТаблицы()
