Перем ПостроительФорм;

#Область Инициализация

Процедура Инициализация(_ПостроительФорм) Экспорт 
	
	ПостроительФорм = _ПостроительФорм;
	
КонецПроцедуры

#КонецОбласти

Функция РеквизитТаблицаЗначенийПоОписанию(ОписаниеТаблицы) Экспорт 

	ПостроительФорм
	.РеквизитТаблицаЗначений(ОписаниеТаблицы.Имя)
	.ПутьРеквизита(ОписаниеТаблицы.Имя);
	
	Для Каждого Реквизит из ОписаниеТаблицы.Реквизиты Цикл
		ПостроительФорм.ДобавитьРеквизит(Реквизит.Имя, Реквизит.Тип);	
	КонецЦикла;
	
	ПостроительФорм.ПутьРеквизита();
	
	Возврат ПостроительФорм;

КонецФункции // РеквизитТаблицаЗначений()

Функция ТаблицаФормыПоОПисанию(ОписаниеТаблицы) Экспорт 

	ГруппаТаблицы = "гр" + ОписаниеТаблицы.Имя;
	
	ПостроительФорм
	.ГруппаФормы(ГруппаТаблицы)
		.Родитель(ОписаниеТаблицы.Родитель)
		.Группировка(ГруппировкаПодчиненныхЭлементовФормы.Вертикальная)
		.ОтображатьЗаголовок(Ложь)
		
	.ТаблицаФормы(ОписаниеТаблицы.Имя)
		.Родитель(ГруппаТаблицы)
		.Заголовок(ОписаниеТаблицы.Заголовок)
		.ПутьКДанным(ОписаниеТаблицы.Имя);
		
	Для Каждого ТекЭлемент из ОписаниеТаблицы.Реквизиты Цикл
		ПостроительФорм
		.ПолеВвода(ОписаниеТаблицы.Имя + ТекЭлемент.Имя)
			.Родитель(ОписаниеТаблицы.Имя)
			.Заголовок(ТекЭлемент.Заголовок)
			.ПутьКДанным(ОписаниеТаблицы.Имя + "." + ТекЭлемент.Имя);		
	КонецЦикла;

	Если ОписаниеТаблицы.ПереопределитьКоманднуюПанель = Истина Тогда
		ПостроительФорм.Применить()
		.ТекущийЭлемент(ОписаниеТаблицы.Имя + "КоманднаяПанель")
		.Видимость(Ложь)

		.КоманднаяПанель(ОписаниеТаблицы.Имя + "КП")
		.Родитель(ГруппаТаблицы)
		.Переместить(ОписаниеТаблицы.Имя)	
	КонецЕсли;
	
	Возврат ПостроительФорм;

КонецФункции // ТаблицаФормыПоОПисанию()

Функция РеквизитИЭлементФормыТаблицаПоОписанию(ОписаниеТаблицы) Экспорт 

	РеквизитТаблицаЗначенийПоОписанию(ОписаниеТаблицы);
	ТаблицаФормыПоОПисанию(ОписаниеТаблицы);
	
	Возврат ПостроительФорм;

КонецФункции // РевизитИЭлементФормыТаблица()


